{
  "books": [
    {
      "id": 1,
      "title": "Harry Potter",
      "author": "J. K. Rowling",
      "synopsis": "Harry Potter é um garoto órfão que vive infeliz com seus tios, os Dursleys. Ele recebe uma carta contendo um convite para ingressar em Hogwarts, uma famosa escola especializada em formar jovens bruxos. Inicialmente, Harry é impedido de ler a carta por seu tio, mas logo recebe a visita de Hagrid, o guarda-caça de Hogwarts, que chega para levá-lo até a escola. Harry adentra um mundo mágico que jamais imaginara, vivendo diversas aventuras com seus novos amigos, Rony Weasley e Hermione Granger.",
      "image": "https://m.media-amazon.com/images/I/710ESoXqVPL._SL1200_.jpg",
      "price": 40.5
    },
    {
      "id": 2,
      "title": "A Revolução dos Bichos",
      "author": "George Orwell",
      "synopsis": "Verdadeiro clássico moderno, concebido por um dos mais influentes escritores do século XX, A revolução dos bichos é uma fábula sobre o poder. Narra a insurreição dos animais de uma granja contra seus donos. Progressivamente, porém, a revolução degenera numa tirania ainda mais opressiva que a dos humanos.",
      "image": "https://m.media-amazon.com/images/I/91BsZhxCRjL._SL1500_.jpg",
      "price": 25.2
    },
    {
      "id": 3,
      "title": "Tudo é Rio",
      "author": "Carla Madeira",
      "synopsis": "Com uma narrativa madura, precisa e ao mesmo tempo delicada e poética, o romance narra a história do casal Dalva e Venâncio, que tem a vida transformada após uma perda trágica, resultado do ciúme doentio do marido.",
      "image": "https://m.media-amazon.com/images/I/816Udvs9O7L._SL1500_.jpg",
      "price": 48.8
    },
    {
      "id": 4,
      "title": "Capitães da Areia",
      "author": "Jorge Amado",
      "synopsis": "Capitães da areia é uma obra precursora, portanto, modelar. É a partir dela que outras narrativas brasileiras que focam em grupos de adolescentes vivendo na marginalidade arriscada são produzidas, como “Cidade de Deus”, de Paulo Lins, e “Querô”, de Plínio Marcos. As crianças  ainda estão na idade dos sonhos, mas já perspectivam a batalha que é vida adulta; por isso conjecturam uns com os outros, ou intimamente, o que cada um “gostaria de ser”.",
      "image": "https://m.media-amazon.com/images/I/816CKGW3kXL._SL1500_.jpg",
      "price": 45.1
    },
    {
      "id": 5,
      "title": "Maus",
      "author": "Art Spiegelman",
      "synopsis": "Clássico contemporâneo dos quadrinhos, Maus é um relato comovente sobre Auschwitz e um acerto de contas do artista com o pai. Única história em quadrinhos a receber o Prêmio Pulitzer.",
      "image": "https://m.media-amazon.com/images/I/916IgqQ-54L._SL1500_.jpg",
      "price": 68.8
    },
    {
      "id": 6,
      "title": "Sapiens",
      "author": "Yuval Noah Harari",
      "synopsis": "Sapiens é a obra-prima de Yuval Noah Harari e o consagrou como um dos pensadores mais brilhantes da atualidade. Num feito surpreendente, que já fez deste livro um clássico contemporâneo, o historiador israelense aplica uma fascinante narrativa histórica a todas as instâncias do percurso humano sobre a Terra. Da Idade da Pedra ao Vale do Silício, temos aqui uma visão ampla e crítica da jornada em que deixamos de ser meros símios para nos tornarmos os governantes do mundo.",
      "image": "https://m.media-amazon.com/images/I/71-ghLb8qML._SL1500_.jpg",
      "price": 75.1
    },
    {
      "id": 7,
      "title": "O Nome do Vento",
      "author": "Patrick Rothfuss",
      "synopsis": "Ninguém sabe ao certo quem é o herói ou o vilão desse fascinante universo criado por Patrick Rothfuss. Na realidade, essas duas figuras se concentram em Kote, um homem enigmático que se esconde sob a identidade de proprietário da hospedaria Marco do Percurso.",
      "image": "https://m.media-amazon.com/images/I/81CGmkRG9GL._SL1500_.jpg",
      "price": 55.1
    },
    {
      "id": 8,
      "title": "A Teia de Charlotte",
      "author": "E B. White",
      "synopsis": "Em uma manhã de primavera, a garotinha Fern resgata um porquinho e o nomeia Wilbur. Vendido para o tio de Fern e mandado para a fazenda dele, o porquinho faz amizade com os animais de lá ― incluindo a gentil aranha Charlotte. Mas, quando Wilbur precisa enfrentar o cruel destino de sua espécie, Fern e Charlotte se juntam aos outros animais para bolarem um plano infalível e salvarem esse porquinho muito especial.",
      "image": "https://m.media-amazon.com/images/I/91RdYbmF5PL._SL1500_.jpg",
      "price": 33.1
    },
    {
      "id": 9,
      "title": "Corte de espinhos e rosas 1",
      "author": "Sarah J. Maas",
      "synopsis": "Ela roubou uma vida. Agora deve pagar com o coração. Em Corte de espinhos e rosas, livro que da início a uma das séries mais queridas pelo público, acompanhe as aventuras de Feyre pelo perigoso e deslumbrante mundo das fadas.",
      "image": "https://m.media-amazon.com/images/I/91frS6qRfbL._SL1500_.jpg",
      "price": 46.2
    },
    {
      "id": 10,
      "title": "O Oceano no Fim Do Caminho",
      "author": "Neil Gaiman",
      "synopsis": "Foi há quarenta anos, agora ele lembra muito bem. Quando os tempos ficaram difíceis e os pais decidiram que o quarto do alto da escada, que antes era dele, passaria a receber hóspedes. Ele só tinha sete anos.",
      "image": "https://m.media-amazon.com/images/I/710tshetuTL._SL1000_.jpg",
      "price": 35.1
    },
    {
      "id": 11,
      "title": "Daisy Jones and The Six",
      "author": "Taylor Jenkins Reid",
      "synopsis": "Embalado pelo melhor do rock'n'roll, um romance inesquecível sobre uma banda dos anos 1970, sua apaixonante vocalista e o amor à música. Da autora de Em outra vida, talvez?",
      "image": "https://m.media-amazon.com/images/I/91ob37hsqNL._SL1500_.jpg",
      "price": 57.5
    },
    {
      "id": 12,
      "title": "O Jardim Secreto",
      "author": "Frances Hodgson Burnett",
      "synopsis": "As histórias mais mágicas são capazes de atravessar as barreiras do tempo e encantar leitores de diferentes gerações. Em 1911, Frances Hodgson Burnett presenteou o mundo com O Jardim Secreto, uma história doce e delicada sobre o poder transformador da magia, da natureza e da amizade.",
      "image": "https://m.media-amazon.com/images/I/61EERnVHUFL._SL1000_.jpg",
      "price": 55.1
    },
    {
      "id": 13,
      "title": "Alice No País Das Maravilhas",
      "author": "Lewis Carroll",
      "synopsis": "Uma menina, um coelho e uma história capazes de fazer qualquer um de nós voltar a sonhar. Alice é despertada de um leve sono ao pé de uma árvore por um coelho peculiar. Uma criatura alva e falante com roupas engraçadas, que consulta seu relógio e reclama do próprio atraso.",
      "image": "https://m.media-amazon.com/images/I/91rtArfzScL._SL1500_.jpg",
      "price": 62.8
    },
    {
      "id": 14,
      "title": "Testes de Edição",
      "author": "IanRibeiroDev",
      "synopsis": "Naaaaaaaaaaaaao. Nao edite o preço e destrua meu plano diabólico de ficar riiiicoooo. NAAAAAAAAAAOOOOOOOO ;(",
      "image": "https://th.bing.com/th/id/OIG.907b97h.qhKZKVc2IGMw?pid=ImgGn&w=1024&h=1024&rs=1",
      "price": 1e+32
    }
  ]
}